app/views/restaurants/index.html.erb


    <h4><%= pluralize restaurant.reviews.count, 'review' %></h4>
---
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 19]]
SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 19]]