app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("address", "created_at", "cuisine", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["address", "1"], ["created_at", "2014-05-20 13:30:58.635431"], ["cuisine", ""], ["name", "nandos"], ["updated_at", "2014-05-20 13:30:58.635431"]]
---
	def create
		@restaurant = Restaurant.new(params[:restaurant].permit(:name, :address, :cuisine))

			if @restaurant.save

SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 35]]
UPDATE "restaurants" SET "cuisine" = $1, "name" = $2, "updated_at" = $3 WHERE "restaurants"."id" = 26  [["cuisine", ""], ["name", "Kentucky Fried Chicken"], ["updated_at", "2014-05-20 13:24:55.893918"]]
---
	def update
		@restaurant = Restaurant.find(params[:id])

		if @restaurant.update(params[:restaurant].permit(:name, :address, :cuisine))