app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 42]]
INSERT INTO "reviews" ("created_at", "rating", "restaurant_id", "thoughts", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-05-20 18:24:07.062762"], ["rating", 4], ["restaurant_id", 2], ["thoughts", "This was decent"], ["updated_at", "2014-05-20 18:24:07.062762"]]
---
	def create
		@restaurant = Restaurant.find(params[:restaurant_id])
		review = @restaurant.reviews.create!(params[:review].permit(:thoughts, :rating))