app/views/reviews/create.json.jbuilder

	json.average_rating_stars star_rating(@restaurant.average_rating)
	json.review_count pluralize(@restaurant.reviews.count, 'review')
---
SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 5]]